# InitialIlluminanceIntensity Constructor (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InitialIlluminanceIntensity Constructor
InitialIlluminanceIntensity Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| InitialIlluminanceIntensity(InitialIlluminanceIntensity) | Creates a copy of the given initial illuminance intensity object |
| InitialIlluminanceIntensity(Double, Double) | Creates an initial illuminance intensity object with the given document and illuminance values. |

# See Also
InitialIlluminanceIntensity Class
InitialIlluminanceIntensity Members
Autodesk.Revit.DB.Lighting Namespace